# FindDefinitionType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeLibrary..::..FindDefinitionType Method
DirectShapeLibrary Class See Also
---
Find a DirectShapeType element by definition id. The element will be used for creating instances of that definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId FindDefinitionType(
	string id
)
```

Visual Basic
---
```text
Public Function FindDefinitionType ( _
	id As String _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ FindDefinitionType(
	String^ id
)
```

# ### Parameters
id
    Type: System..::..String Definition id. Expected to be unique.
# ### Return Value
Element id of a DirectShapeTypeElement
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace